; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-3-47)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	package47 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p1-2 - location
	p3-0 - location
	p3-4 - location
	p3-5 - location
	p4-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s4)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s4)
	(at package2 s2)
	(at package3 s0)
	(at package4 s5)
	(at package5 s2)
	(at package6 s1)
	(at package7 s0)
	(at package8 s2)
	(at package9 s3)
	(at package10 s1)
	(at package11 s2)
	(at package12 s5)
	(at package13 s2)
	(at package14 s2)
	(at package15 s2)
	(at package16 s0)
	(at package17 s0)
	(at package18 s1)
	(at package19 s2)
	(at package20 s4)
	(at package21 s2)
	(at package22 s1)
	(at package23 s2)
	(at package24 s2)
	(at package25 s2)
	(at package26 s1)
	(at package27 s2)
	(at package28 s0)
	(at package29 s3)
	(at package30 s1)
	(at package31 s4)
	(at package32 s5)
	(at package33 s0)
	(at package34 s1)
	(at package35 s3)
	(at package36 s2)
	(at package37 s3)
	(at package38 s3)
	(at package39 s3)
	(at package40 s0)
	(at package41 s3)
	(at package42 s2)
	(at package43 s3)
	(at package44 s2)
	(at package45 s2)
	(at package46 s0)
	(at package47 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s3 s5)
	(link s5 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at truck2 s1)
	(at package1 s2)
	(at package2 s1)
	(at package3 s4)
	(at package4 s0)
	(at package5 s3)
	(at package7 s1)
	(at package8 s5)
	(at package9 s0)
	(at package10 s5)
	(at package11 s3)
	(at package12 s5)
	(at package13 s0)
	(at package14 s0)
	(at package15 s2)
	(at package16 s3)
	(at package17 s3)
	(at package18 s0)
	(at package19 s3)
	(at package20 s5)
	(at package21 s2)
	(at package22 s2)
	(at package23 s4)
	(at package24 s0)
	(at package25 s3)
	(at package26 s4)
	(at package27 s5)
	(at package28 s0)
	(at package29 s2)
	(at package30 s1)
	(at package31 s3)
	(at package32 s4)
	(at package33 s1)
	(at package35 s0)
	(at package36 s2)
	(at package37 s4)
	(at package38 s5)
	(at package39 s2)
	(at package40 s3)
	(at package41 s1)
	(at package42 s1)
	(at package43 s2)
	(at package45 s1)
	(at package46 s3)
	(at package47 s1)
	))


)

; plan
1. (board-truck driver4 s4 truck1)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 7 of 49
2. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 7 of 49
3. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 7 of 49
4. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 7 of 49
5. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 7 of 49
6. (load-truck s2 package47 truck1)
   deleted: (at package47 s2)
   added: (in package47 truck1)
   goals met: 7 of 49
7. (load-truck s2 package45 truck1)
   deleted: (at package45 s2)
   added: (in package45 truck1)
   goals met: 7 of 49
8. (load-truck s2 package42 truck1)
   deleted: (at package42 s2)
   added: (in package42 truck1)
   goals met: 7 of 49
9. (load-truck s2 package27 truck1)
   deleted: (at package27 s2)
   added: (in package27 truck1)
   goals met: 7 of 49
10. (load-truck s2 package25 truck1)
   deleted: (at package25 s2)
   added: (in package25 truck1)
   goals met: 7 of 49
11. (load-truck s2 package24 truck1)
   deleted: (at package24 s2)
   added: (in package24 truck1)
   goals met: 7 of 49
12. (load-truck s2 package23 truck1)
   deleted: (at package23 s2)
   added: (in package23 truck1)
   goals met: 7 of 49
13. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 7 of 49
14. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 7 of 49
15. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 7 of 49
16. (load-truck s3 package9 truck1)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 7 of 49
17. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 7 of 49
18. (unload-truck s5 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 8 of 49
19. (load-truck s5 package4 truck1)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 8 of 49
20. (drive-truck driver4 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 8 of 49
21. (load-truck s2 package14 truck1)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   goals met: 8 of 49
22. (load-truck s2 package13 truck1)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   goals met: 8 of 49
23. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 8 of 49
24. (unload-truck s0 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   goals met: 9 of 49
25. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 9 of 49
26. (load-truck s5 package32 truck1)
   deleted: (at package32 s5)
   added: (in package32 truck1)
   goals met: 9 of 49
27. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 9 of 49
28. (unload-truck s4 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s4)
   goals met: 10 of 49
29. (load-truck s4 package31 truck1)
   deleted: (at package31 s4)
   added: (in package31 truck1)
   goals met: 10 of 49
30. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 10 of 49
31. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 10 of 49
32. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 10 of 49
33. (unload-truck s3 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   goals met: 11 of 49
34. (load-truck s3 package43 truck1)
   deleted: (at package43 s3)
   added: (in package43 truck1)
   goals met: 11 of 49
35. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 11 of 49
36. (unload-truck s2 package43 truck1)
   deleted: (in package43 truck1)
   added: (at package43 s2)
   goals met: 12 of 49
37. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 12 of 49
38. (load-truck s0 package7 truck1)
   deleted: (at package7 s0)
   added: (in package7 truck1)
   goals met: 12 of 49
39. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 12 of 49
40. (unload-truck s4 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s4)
   goals met: 13 of 49
41. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 13 of 49
42. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 13 of 49
43. (load-truck s3 package41 truck1)
   deleted: (at package41 s3)
   added: (in package41 truck1)
   goals met: 13 of 49
44. (load-truck s3 package39 truck1)
   deleted: (at package39 s3)
   added: (in package39 truck1)
   goals met: 13 of 49
45. (load-truck s3 package38 truck1)
   deleted: (at package38 s3)
   added: (in package38 truck1)
   goals met: 13 of 49
46. (load-truck s3 package37 truck1)
   deleted: (at package37 s3)
   added: (in package37 truck1)
   goals met: 13 of 49
47. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 13 of 49
48. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 13 of 49
49. (unload-truck s4 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s4)
   goals met: 14 of 49
50. (load-truck s4 package20 truck1)
   deleted: (at package20 s4)
   added: (in package20 truck1)
   goals met: 14 of 49
51. (load-truck s4 package1 truck1)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   goals met: 14 of 49
52. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 14 of 49
53. (load-truck s0 package46 truck1)
   deleted: (at package46 s0)
   added: (in package46 truck1)
   goals met: 14 of 49
54. (load-truck s0 package40 truck1)
   deleted: (at package40 s0)
   added: (in package40 truck1)
   goals met: 14 of 49
55. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 14 of 49
56. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 14 of 49
57. (unload-truck s3 package46 truck1)
   deleted: (in package46 truck1)
   added: (at package46 s3)
   goals met: 15 of 49
58. (unload-truck s3 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s3)
   goals met: 16 of 49
59. (load-truck s3 package35 truck1)
   deleted: (at package35 s3)
   added: (in package35 truck1)
   goals met: 16 of 49
60. (unload-truck s3 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s3)
   goals met: 17 of 49
61. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 17 of 49
62. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 17 of 49
63. (unload-truck s0 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 18 of 49
64. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 18 of 49
65. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 18 of 49
66. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 18 of 49
67. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 18 of 49
68. (unload-truck s0 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s0)
   goals met: 19 of 49
69. (load-truck s0 package33 truck1)
   deleted: (at package33 s0)
   added: (in package33 truck1)
   goals met: 19 of 49
70. (load-truck s0 package3 truck1)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 19 of 49
71. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 19 of 49
72. (drive-truck driver4 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 19 of 49
73. (unload-truck s4 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 20 of 49
74. (load-truck s1 package26 truck2)
   deleted: (at package26 s1)
   added: (in package26 truck2)
   goals met: 20 of 49
75. (board-truck driver1 s1 truck2)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 20 of 49
76. (load-truck s1 package22 truck2)
   deleted: (at package22 s1)
   added: (in package22 truck2)
   goals met: 20 of 49
77. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 20 of 49
78. (drive-truck driver1 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 19 of 49
79. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 19 of 49
80. (unload-truck s1 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 20 of 49
81. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 20 of 49
82. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 20 of 49
83. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 20 of 49
84. (unload-truck s2 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s2)
   goals met: 21 of 49
85. (unload-truck s2 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s2)
   goals met: 22 of 49
86. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 22 of 49
87. (unload-truck s0 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s0)
   goals met: 23 of 49
88. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 23 of 49
89. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 23 of 49
90. (unload-truck s1 package47 truck1)
   deleted: (in package47 truck1)
   added: (at package47 s1)
   goals met: 24 of 49
91. (unload-truck s1 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s1)
   goals met: 25 of 49
92. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 25 of 49
93. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 25 of 49
94. (unload-truck s5 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s5)
   goals met: 26 of 49
95. (unload-truck s5 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s5)
   goals met: 27 of 49
96. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 27 of 49
97. (load-truck s0 package17 truck1)
   deleted: (at package17 s0)
   added: (in package17 truck1)
   goals met: 27 of 49
98. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 27 of 49
99. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 27 of 49
100. (unload-truck s3 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s3)
   goals met: 28 of 49
101. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 28 of 49
102. (unload-truck s1 package42 truck1)
   deleted: (in package42 truck1)
   added: (at package42 s1)
   goals met: 29 of 49
103. (unload-truck s1 package41 truck1)
   deleted: (in package41 truck1)
   added: (at package41 s1)
   goals met: 30 of 49
104. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 30 of 49
105. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 30 of 49
106. (load-truck s2 package11 truck1)
   deleted: (at package11 s2)
   added: (in package11 truck1)
   goals met: 30 of 49
107. (unload-truck s2 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 31 of 49
108. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 31 of 49
109. (unload-truck s3 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s3)
   goals met: 32 of 49
110. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 32 of 49
111. (unload-truck s5 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s5)
   goals met: 33 of 49
112. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 33 of 49
113. (load-truck s0 package16 truck1)
   deleted: (at package16 s0)
   added: (in package16 truck1)
   goals met: 33 of 49
114. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 33 of 49
115. (drive-truck driver4 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 33 of 49
116. (unload-truck s3 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s3)
   goals met: 34 of 49
117. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 34 of 49
118. (unload-truck s1 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s1)
   goals met: 35 of 49
119. (unload-truck s1 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 36 of 49
120. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 36 of 49
121. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 36 of 49
122. (unload-truck s4 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s4)
   goals met: 37 of 49
123. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 37 of 49
124. (unload-truck s0 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s0)
   goals met: 38 of 49
125. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 38 of 49
126. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 38 of 49
127. (unload-truck s0 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s0)
   goals met: 39 of 49
128. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 39 of 49
129. (unload-truck s2 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s2)
   goals met: 40 of 49
130. (drive-truck driver1 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 40 of 49
131. (drive-truck driver1 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 41 of 49
132. (load-truck s1 package10 truck2)
   deleted: (at package10 s1)
   added: (in package10 truck2)
   goals met: 41 of 49
133. (drive-truck driver1 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 40 of 49
134. (drive-truck driver1 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 40 of 49
135. (unload-truck s5 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s5)
   goals met: 41 of 49
136. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 41 of 49
137. (unload-truck s0 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s0)
   goals met: 42 of 49
138. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 42 of 49
139. (drive-truck driver4 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 42 of 49
140. (unload-truck s3 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s3)
   goals met: 43 of 49
141. (unload-truck s3 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s3)
   goals met: 44 of 49
142. (disembark-truck driver4 s3 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 44 of 49
143. (walk driver4 s3 p3-0)
   deleted: (at driver4 s3)
   added: (at driver4 p3-0)
   goals met: 44 of 49
144. (walk driver4 p3-0 s0)
   deleted: (at driver4 p3-0)
   added: (at driver4 s0)
   goals met: 45 of 49
145. (drive-truck driver1 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 45 of 49
146. (disembark-truck driver1 s0 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 46 of 49
147. (walk driver2 s2 p1-2)
   deleted: (at driver2 s2)
   added: (at driver2 p1-2)
   goals met: 46 of 49
148. (board-truck driver4 s0 truck2)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 45 of 49
149. (walk driver2 p1-2 s1)
   deleted: (at driver2 p1-2)
   added: (at driver2 s1)
   goals met: 45 of 49
150. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   goals met: 45 of 49
151. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   goals met: 45 of 49
152. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 45 of 49
153. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 46 of 49
154. (disembark-truck driver4 s0 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 47 of 49
155. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   goals met: 47 of 49
156. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   goals met: 47 of 49
157. (board-truck driver3 s3 truck1)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 47 of 49
158. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 47 of 49
159. (disembark-truck driver3 s2 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 48 of 49
160. (board-truck driver4 s0 truck2)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 47 of 49
161. (drive-truck driver4 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 47 of 49
162. (drive-truck driver4 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 48 of 49
163. (disembark-truck driver4 s1 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 48 of 49
164. (walk driver4 s1 p0-1)
   deleted: (at driver4 s1)
   added: (at driver4 p0-1)
   goals met: 48 of 49
165. (walk driver4 p0-1 s0)
   deleted: (at driver4 p0-1)
   added: (at driver4 s0)
   goals met: 49 of 49
